
## Plan Result (aat)




<pre><code>Plan: 8 to add, 8 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.admin[0]
  * azurerm_role_assignment.app_insights_dcd_cnp_prod_access[0]
  * azurerm_role_assignment.editors[0]
  * azurerm_role_assignment.more_viewers[0]
  * azurerm_role_assignment.platops[0]
  * azurerm_role_assignment.readers[0]
  * azurerm_role_assignment.viewers[0]
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]
* Update
  * azurerm_dashboard_grafana.main[0]
  * azurerm_key_vault_secret.DB-URL[0]
  * azurerm_resource_group.rg
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group
  * module.application_insights.azurerm_application_insights.this
  * module.key-vault.azurerm_key_vault.kv
  * module.key-vault.azurerm_user_assigned_identity.managed_identity[0]
  * module.postgresql[0].azurerm_postgresql_flexible_server.pgsql_server


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_dashboard_grafana.main[0] will be updated in-place
  ~ resource "azurerm_dashboard_grafana" "main" {
        id                                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat"
        name                                   = "dtsse-grafana-aat"
      ~ tags                                   = {
            "application"         = "core"
            "autoShutdown"        = "true"
          ~ "builtFrom"           = "https://github.com/HMCTS/grafana-infrastructure.git" -> "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
            "businessArea"        = "CFT"
          + "contactSlackChannel" = "#reform-swe"
          - "criticality"         = "High" -> null
            "environment"         = "staging"
          + "managedBy"           = "DTS Software Engineering"
          - "startupMode"         = "always" -> null
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.DB-URL[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "DB-URL" {
        id                      = "https://dtsse-aat.vault.azure.net/secrets/db-url/9e60d17b6208497ab90f40c8bc7f490e"
        name                    = "db-url"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat"
        name       = "dtsse-aat"
      ~ tags       = {
            "application"         = "core"
            "autoShutdown"        = "true"
          ~ "builtFrom"           = "https://github.com/HMCTS/grafana-infrastructure.git" -> "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
            "businessArea"        = "CFT"
          + "contactSlackChannel" = "#reform-swe"
          - "criticality"         = "High" -> null
            "environment"         = "staging"
          + "managedBy"           = "DTS Software Engineering"
          - "startupMode"         = "always" -> null
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.admin[0] will be created
  + resource "azurerm_role_assignment" "admin" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c2c7af6e-4427-45c2-8ca8-03b8ebe2d11f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.app_insights_dcd_cnp_prod_access[0] will be created
  + resource "azurerm_role_assignment" "app_insights_dcd_cnp_prod_access" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c12e370f-172e-4620-bc82-d4ef4bd79867"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.editors[0] will be created
  + resource "azurerm_role_assignment" "editors" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Editor"
      + scope                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.more_viewers[0] will be created
  + resource "azurerm_role_assignment" "more_viewers" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d0f6d0b1-d067-40ac-80b4-2ec5bc5fd817"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Viewer"
      + scope                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.platops[0] will be created
  + resource "azurerm_role_assignment" "platops" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.readers[0] will be created
  + resource "azurerm_role_assignment" "readers" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "94f8f711-f032-4fbe-a878-6fc519358d88"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Viewer"
      + scope                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.viewers[0] will be created
  + resource "azurerm_role_assignment" "viewers" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "98bbe6e9-2878-4bc6-b602-30ad18b6e934"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Viewer"
      + scope                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Dashboard/grafana/dtsse-grafana-aat"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Resources/deployments/DTSSE_Alert"
        name                     = "DTSSE_Alert"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_application_insights.this will be updated in-place
  ~ resource "azurerm_application_insights" "this" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Insights/components/dtsse-appinsights-aat"
        name                                  = "dtsse-appinsights-aat"
      ~ tags                                  = {
            "application"         = "core"
            "autoShutdown"        = "true"
          ~ "builtFrom"           = "https://github.com/HMCTS/grafana-infrastructure.git" -> "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
            "businessArea"        = "CFT"
          + "contactSlackChannel" = "#reform-swe"
          - "criticality"         = "High" -> null
            "environment"         = "staging"
          + "managedBy"           = "DTS Software Engineering"
          - "startupMode"         = "always" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Application-Insights-daily-cap-reached-dtsse-appinsights-aat"
      + resource_group_name = "dtsse-aat"
      + scopes              = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Insights/components/dtsse-appinsights-aat",
        ]
      + tags                = {
          + "application"         = "core"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#reform-swe"
          + "environment"         = "staging"
          + "managedBy"           = "DTS Software Engineering"
        }

      + action {
          + action_group_id    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = null
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Insights/components/dtsse-appinsights-aat"

          + resource_health (known after apply)

          + service_health (known after apply)
        }
    }

  # module.key-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.KeyVault/vaults/dtsse-aat"
        name                            = "dtsse-aat"
      ~ tags                            = {
            "application"         = "core"
            "autoShutdown"        = "true"
          ~ "builtFrom"           = "https://github.com/HMCTS/grafana-infrastructure.git" -> "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
            "businessArea"        = "CFT"
          + "contactSlackChannel" = "#reform-swe"
          - "criticality"         = "High" -> null
            "environment"         = "staging"
          + "managedBy"           = "DTS Software Engineering"
          - "startupMode"         = "always" -> null
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.key-vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dtsse-aat-mi"
        name                = "dtsse-aat-mi"
      ~ tags                = {
            "application"         = "core"
            "autoShutdown"        = "true"
          ~ "builtFrom"           = "https://github.com/HMCTS/grafana-infrastructure.git" -> "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
            "businessArea"        = "CFT"
          + "contactSlackChannel" = "#reform-swe"
          - "criticality"         = "High" -> null
            "environment"         = "staging"
          + "managedBy"           = "DTS Software Engineering"
          - "startupMode"         = "always" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.postgresql[0].data.azuread_group.db_admin will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "db_admin" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Platform Operations"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.postgresql[0].data.azuread_service_principal.mi_name[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_service_principal" "mi_name" {
      + account_enabled               = (known after apply)
      + alternative_names             = (known after apply)
      + app_role_assignment_required  = (known after apply)
      + app_role_ids                  = (known after apply)
      + app_roles                     = (known after apply)
      + application_id                = (known after apply)
      + application_tenant_id         = (known after apply)
      + client_id                     = (known after apply)
      + description                   = (known after apply)
      + display_name                  = (known after apply)
      + feature_tags                  = (known after apply)
      + features                      = (known after apply)
      + homepage_url                  = (known after apply)
      + id                            = (known after apply)
      + login_url                     = (known after apply)
      + logout_url                    = (known after apply)
      + notes                         = (known after apply)
      + notification_email_addresses  = (known after apply)
      + oauth2_permission_scope_ids   = (known after apply)
      + oauth2_permission_scopes      = (known after apply)
      + object_id                     = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + preferred_single_sign_on_mode = (known after apply)
      + redirect_uris                 = (known after apply)
      + saml_metadata_url             = (known after apply)
      + saml_single_sign_on           = (known after apply)
      + service_principal_names       = (known after apply)
      + sign_in_audience              = (known after apply)
      + tags                          = (known after apply)
      + type                          = (known after apply)
    }

  # module.postgresql[0].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.postgresql[0].data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat"
        name                              = "dtsse-dashboard-flexdb-aat"
      ~ tags                              = {
            "application"         = "core"
            "autoShutdown"        = "true"
          ~ "builtFrom"           = "https://github.com/HMCTS/grafana-infrastructure.git" -> "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
            "businessArea"        = "CFT"
          + "contactSlackChannel" = "#reform-swe"
          - "criticality"         = "High" -> null
            "environment"         = "staging"
          + "managedBy"           = "DTS Software Engineering"
          - "startupMode"         = "always" -> null
        }
        # (21 unchanged attributes hidden)

      ~ authentication {
          ~ tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 8 to add, 8 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":213,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->